OPENFOAM/parallelPlates/nu_10_3/v_4/parallel_plate_A/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

zmin 0;
zmax 1;
xmin 0;
xmax 10;
ymax 0.2;
ymin 0;

xcells 200;
ycells 50;
zcells 1;

vertices
(
    ($xmin $ymin $zmin)       // 0
    ($xmax $ymin $zmin)       // 1
    ($xmax $ymax $zmin)       // 2 
    ($xmin $ymax $zmin)       // 3
//
    ($xmin $ymin $zmax)       // 4
    ($xmax $ymin $zmax)       // 5
    ($xmax $ymax $zmax)       // 6 
    ($xmin $ymax $zmax)       // 7
    
);

blocks
(
    hex ( 0  1  2  3  4  5  6  7) ($xcells $ycells $zcells)
    simpleGrading
    (
        // x
        (
            (1.0 1.0 10)
        )
        // y
        (
            (0.2 .25 10)
            (0.6 .5  1)
            (0.2 .25 0.1)        
        )
        // z
        1
    
    )
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            ( 1  0  4  5)
            //            
            ( 7  6  2  3)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            //
            (0 1 2 3)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
